---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ViewPrintedEventArgs
source: html/4aaac93d-456a-5b34-154f-c16acf37f6db.htm
---
# ViewPrintedEventArgs Methods

Indicates whether the event is being cancelled.